{
    "head": {
        "title": "CSRFShark"
    },
    "request": {
        "title": "Запрос",
        "headControls": {
            "protocol": "Протокол"
        },
        "tailControls": {
            "clear": "Очистить",
            "urlDecode": "Декодировать URL",
            "copy": "Копировать"
        }
    },
    "result": {
        "title": "Результат",
        "headControls": {
            "technique": "Техника"
        },
        "tailControls": {
            "run": "Запустить",
            "download": "Скачать",
            "copy": "Копировать",
            "share": "Поделиться"
        }
    },
    "footer": {
        "version": "Версия",
        "license": "Лицензия",
        "homePage": "Домашняя страница"
    },
    "modal": {
        "close": "Закрыть",
        "apply": "Применить",
        "options": {
            "title": "Настройки",
            "body": {
                "language": "Язык",
                "theme": "Тема",
                "themeOptions": {
                    "dark": "Тёмная",
                    "light": "Светлая"
                }
            }
        },
        "share": {
            "title": "Поделиться",
            "body": {
                "copy": "Копировать ссылку",
                "qrFullscreen": "Показать QR код"
            }
        },
        "shareWarning": {
            "title": "Предупреждение",
            "body": {
                "text": "Ссылка, по которой Вы перешли, содержит в себе данные для генерации proof of concept (PoC) cross-site request forgery (CSRF) атаки. Помните, что в результате запуска CSRF PoC, от вашего имени могут быть выполнены нежелательные действия, а также ваша учётная запись в каком либо веб-сайте может быть скомпрометирована. Перед запуском proof of concept обязательно убедитесь в том, что вы полностью понимаете, какие действия будут выполнены после его запуска. Если кто-то сказал вам скопировать и вставить сюда какие-либо данные, но вы не осознаете последствия этого действия, пожалуйста, не делайте этого."
            }
        },
        "firstVisitWarning": {
            "title": "Отказ от ответственности",
            "body": {
                "text": "Данный инструмент предназначен только для образовательных целей. Использование этой программы для атак на цели без предварительного взаимного согласия является незаконным. Конечный пользователь несет ответственность за соблюдение всех применимых местных, государственных и федеральных законов. Разработчики не несут никакой ответственности и не отвечают за любое неправильное использование или ущерб, причиненный этой программой."
            }
        },
        "shareFullscreenQrCode": {
            "title": "Полноэкранный QR код"
        }
    }
}